zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT798SGAWAR-pinctrl.h
#define CLKCTL0_CLKIN_PIO1_15 IOPCTL_MUX(0, 47, 5) /* PIO1_15 */
#define CTIMER3_MATCH1_PIO1_15 IOPCTL_MUX(0, 47, 4) /* PIO1_15 */
#define GPIO1_GPIO15_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define LP_FLEXCOMM2_P3_PIO1_15 IOPCTL_MUX(0, 47, 1) /* PIO1_15 */
#define PINT0_PINT0_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT1_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT2_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT3_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT4_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT5_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT6_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define PINT0_PINT7_PIO1_15 IOPCTL_MUX(0, 47, 0) /* PIO1_15 */
#define CTIMER3_MATCH2_PIO1_16 IOPCTL_MUX(0, 48, 4) /* PIO1_16 */
#define GPIO1_GPIO16_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define I3C0_PUR_PIO1_16 IOPCTL_MUX(0, 48, 5) /* PIO1_16 */
#define LP_FLEXCOMM3_P2_PIO1_16 IOPCTL_MUX(0, 48, 1) /* PIO1_16 */
#define PINT0_PINT0_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT1_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT2_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT3_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT4_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT5_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT6_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define PINT0_PINT7_PIO1_16 IOPCTL_MUX(0, 48, 0) /* PIO1_16 */
#define CTIMER3_MATCH3_PIO1_17 IOPCTL_MUX(0, 49, 4) /* PIO1_17 */
#define GPIO1_GPIO17_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define I3C0_SCL_PIO1_17 IOPCTL_MUX(0, 49, 5) /* PIO1_17 */
#define LP_FLEXCOMM3_P1_PIO1_17 IOPCTL_MUX(0, 49, 1) /* PIO1_17 */
#define PINT0_PINT0_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT1_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT2_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT3_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT4_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT5_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT6_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define PINT0_PINT7_PIO1_17 IOPCTL_MUX(0, 49, 0) /* PIO1_17 */
#define USB0_OVERCURRENTN_PIO1_17 IOPCTL_MUX(0, 49, 2) /* PIO1_17 */
#define CTIMER4_MATCH0_PIO1_18 IOPCTL_MUX(0, 50, 4) /* PIO1_18 */
#define GPIO1_GPIO18_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define I3C0_SDA_PIO1_18 IOPCTL_MUX(0, 50, 5) /* PIO1_18 */
#define LP_FLEXCOMM3_P0_PIO1_18 IOPCTL_MUX(0, 50, 1) /* PIO1_18 */
#define PINT0_PINT0_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT1_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT2_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT3_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT4_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT5_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT6_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define PINT0_PINT7_PIO1_18 IOPCTL_MUX(0, 50, 0) /* PIO1_18 */
#define USB0_PORTPWRN_PIO1_18 IOPCTL_MUX(0, 50, 2) /* PIO1_18 */
#define EZHV_PIO0_PIO2_0 IOPCTL_MUX(0, 64, 4) /* PIO2_0 */
#define FLEXIO_IO0_PIO2_0 IOPCTL_MUX(0, 64, 5) /* PIO2_0 */
#define GPIO2_GPIO0_PIO2_0 IOPCTL_MUX(0, 64, 0) /* PIO2_0 */
#define LCD_DBI_CSX_AB_PIO2_0 IOPCTL_MUX(0, 64, 7) /* PIO2_0 */
#define USB0_OVERCURRENTN_PIO2_0 IOPCTL_MUX(0, 64, 2) /* PIO2_0 */
#define EZHV_PIO1_PIO2_1 IOPCTL_MUX(0, 65, 4) /* PIO2_1 */
#define FLEXIO_IO1_PIO2_1 IOPCTL_MUX(0, 65, 5) /* PIO2_1 */
#define GPIO2_GPIO1_PIO2_1 IOPCTL_MUX(0, 65, 0) /* PIO2_1 */
#define LCD_DBI_DCX_AB_PIO2_1 IOPCTL_MUX(0, 65, 7) /* PIO2_1 */
#define USB0_PORTPWRN_PIO2_1 IOPCTL_MUX(0, 65, 2) /* PIO2_1 */
#define EZHV_PIO2_PIO2_2 IOPCTL_MUX(0, 66, 4) /* PIO2_2 */
#define FLEXIO_IO2_PIO2_2 IOPCTL_MUX(0, 66, 5) /* PIO2_2 */
#define GPIO2_GPIO2_PIO2_2 IOPCTL_MUX(0, 66, 0) /* PIO2_2 */
#define LCD_DBI_DATA_OEN_PIO2_2 IOPCTL_MUX(0, 66, 7) /* PIO2_2 */
#define LCD_ENABLE_PIO2_2 IOPCTL_MUX(0, 66, 6) /* PIO2_2 */
#define LPSPI16_SOUT_PIO2_2 IOPCTL_MUX(0, 66, 1) /* PIO2_2 */
#define EZHV_PIO3_PIO2_3 IOPCTL_MUX(0, 67, 4) /* PIO2_3 */
#define FLEXIO_IO3_PIO2_3 IOPCTL_MUX(0, 67, 5) /* PIO2_3 */
#define GPIO2_GPIO3_PIO2_3 IOPCTL_MUX(0, 67, 0) /* PIO2_3 */
#define LCD_DBI_RWDX_PIO2_3 IOPCTL_MUX(0, 67, 7) /* PIO2_3 */
#define LCD_DOTCLK_PIO2_3 IOPCTL_MUX(0, 67, 6) /* PIO2_3 */
#define LPSPI16_SCK_PIO2_3 IOPCTL_MUX(0, 67, 1) /* PIO2_3 */
#define EZHV_PIO4_PIO2_4 IOPCTL_MUX(0, 68, 4) /* PIO2_4 */
#define FLEXIO_IO4_PIO2_4 IOPCTL_MUX(0, 68, 5) /* PIO2_4 */
#define GPIO2_GPIO4_PIO2_4 IOPCTL_MUX(0, 68, 0) /* PIO2_4 */
#define LCD_DBI_WRX_PIO2_4 IOPCTL_MUX(0, 68, 7) /* PIO2_4 */
#define LCD_HSYNC_PIO2_4 IOPCTL_MUX(0, 68, 6) /* PIO2_4 */
#define LPSPI16_SIN_PIO2_4 IOPCTL_MUX(0, 68, 1) /* PIO2_4 */
#define EZHV_PIO5_PIO2_5 IOPCTL_MUX(0, 69, 4) /* PIO2_5 */
#define FLEXIO_IO5_PIO2_5 IOPCTL_MUX(0, 69, 5) /* PIO2_5 */
#define GPIO2_GPIO5_PIO2_5 IOPCTL_MUX(0, 69, 0) /* PIO2_5 */
#define LCD_DBI_E_PIO2_5 IOPCTL_MUX(0, 69, 7) /* PIO2_5 */
#define LCD_VSYNC_PIO2_5 IOPCTL_MUX(0, 69, 6) /* PIO2_5 */
#define LPSPI16_PCS0_PIO2_5 IOPCTL_MUX(0, 69, 1) /* PIO2_5 */
#define FLEXIO_IO6_PIO2_6 IOPCTL_MUX(0, 70, 5) /* PIO2_6 */
#define GPIO2_GPIO6_PIO2_6 IOPCTL_MUX(0, 70, 0) /* PIO2_6 */
#define LCDIF_DATA0_PIO2_6 IOPCTL_MUX(0, 70, 6) /* PIO2_6 */
#define LCDIF_DBI_DATA0_PIO2_6 IOPCTL_MUX(0, 70, 7) /* PIO2_6 */
#define LPSPI16_PCS3_PIO2_6 IOPCTL_MUX(0, 70, 1) /* PIO2_6 */
#define EZHV_PIO7_PIO2_7 IOPCTL_MUX(0, 71, 4) /* PIO2_7 */
#define FLEXIO_IO7_PIO2_7 IOPCTL_MUX(0, 71, 5) /* PIO2_7 */
#define GPIO2_GPIO7_PIO2_7 IOPCTL_MUX(0, 71, 0) /* PIO2_7 */
#define LCDIF_DATA1_PIO2_7 IOPCTL_MUX(0, 71, 6) /* PIO2_7 */
#define LCDIF_DBI_DATA1_PIO2_7 IOPCTL_MUX(0, 71, 7) /* PIO2_7 */
#define LPSPI16_PCS2_PIO2_7 IOPCTL_MUX(0, 71, 1) /* PIO2_7 */
#define EZHV_PIO8_PIO2_8 IOPCTL_MUX(0, 72, 4) /* PIO2_8 */
#define FLEXIO_IO8_PIO2_8 IOPCTL_MUX(0, 72, 5) /* PIO2_8 */
#define GPIO2_GPIO8_PIO2_8 IOPCTL_MUX(0, 72, 0) /* PIO2_8 */
#define LCDIF_DATA2_PIO2_8 IOPCTL_MUX(0, 72, 6) /* PIO2_8 */
#define LCDIF_DBI_DATA2_PIO2_8 IOPCTL_MUX(0, 72, 7) /* PIO2_8 */
#define LPSPI16_PCS1_PIO2_8 IOPCTL_MUX(0, 72, 1) /* PIO2_8 */
#define EZHV_PIO9_PIO2_9 IOPCTL_MUX(0, 73, 4) /* PIO2_9 */
#define FLEXIO_IO9_PIO2_9 IOPCTL_MUX(0, 73, 5) /* PIO2_9 */
#define GPIO2_GPIO9_PIO2_9 IOPCTL_MUX(0, 73, 0) /* PIO2_9 */
#define LCDIF_DATA3_PIO2_9 IOPCTL_MUX(0, 73, 6) /* PIO2_9 */
#define LCDIF_DBI_DATA3_PIO2_9 IOPCTL_MUX(0, 73, 7) /* PIO2_9 */
#define EZHV_PIO10_PIO2_10 IOPCTL_MUX(0, 74, 4) /* PIO2_10 */
#define FLEXIO_IO10_PIO2_10 IOPCTL_MUX(0, 74, 5) /* PIO2_10 */
#define GPIO2_GPIO10_PIO2_10 IOPCTL_MUX(0, 74, 0) /* PIO2_10 */
#define LCDIF_DATA4_PIO2_10 IOPCTL_MUX(0, 74, 6) /* PIO2_10 */
#define LCDIF_DBI_DATA4_PIO2_10 IOPCTL_MUX(0, 74, 7) /* PIO2_10 */
#define EZHV_PIO11_PIO2_11 IOPCTL_MUX(0, 75, 4) /* PIO2_11 */
#define FLEXIO_IO11_PIO2_11 IOPCTL_MUX(0, 75, 5) /* PIO2_11 */
#define GPIO2_GPIO11_PIO2_11 IOPCTL_MUX(0, 75, 0) /* PIO2_11 */
#define LCDIF_DATA5_PIO2_11 IOPCTL_MUX(0, 75, 6) /* PIO2_11 */
#define LCDIF_DBI_DATA5_PIO2_11 IOPCTL_MUX(0, 75, 7) /* PIO2_11 */
#define EZHV_PIO12_PIO2_12 IOPCTL_MUX(0, 76, 4) /* PIO2_12 */
#define FLEXIO_IO12_PIO2_12 IOPCTL_MUX(0, 76, 5) /* PIO2_12 */
#define GPIO2_GPIO12_PIO2_12 IOPCTL_MUX(0, 76, 0) /* PIO2_12 */
#define LCDIF_DATA6_PIO2_12 IOPCTL_MUX(0, 76, 6) /* PIO2_12 */
#define LCDIF_DBI_DATA6_PIO2_12 IOPCTL_MUX(0, 76, 7) /* PIO2_12 */
#define EZHV_PIO13_PIO2_13 IOPCTL_MUX(0, 77, 4) /* PIO2_13 */
#define FLEXIO_IO13_PIO2_13 IOPCTL_MUX(0, 77, 5) /* PIO2_13 */
#define GPIO2_GPIO13_PIO2_13 IOPCTL_MUX(0, 77, 0) /* PIO2_13 */
#define LCDIF_DATA7_PIO2_13 IOPCTL_MUX(0, 77, 6) /* PIO2_13 */
#define LCDIF_DBI_DATA7_PIO2_13 IOPCTL_MUX(0, 77, 7) /* PIO2_13 */
#define CLKCTL0_LOW_FREQ_CLKOUT_PIO2_14 IOPCTL_MUX(0, 78, 6) /* PIO2_14 */
#define EZHV_PIO14_PIO2_14 IOPCTL_MUX(0, 78, 4) /* PIO2_14 */
#define FLEXIO_IO14_PIO2_14 IOPCTL_MUX(0, 78, 5) /* PIO2_14 */
#define GPIO2_GPIO14_PIO2_14 IOPCTL_MUX(0, 78, 0) /* PIO2_14 */
#define CLKCTL0_LOW_FREQ_CLKOUT_N_PIO2_15 IOPCTL_MUX(0, 79, 6) /* PIO2_15 */
#define EZHV_PIO15_PIO2_15 IOPCTL_MUX(0, 79, 4) /* PIO2_15 */
#define FLEXIO_IO15_PIO2_15 IOPCTL_MUX(0, 79, 5) /* PIO2_15 */
#define GPIO2_GPIO15_PIO2_15 IOPCTL_MUX(0, 79, 0) /* PIO2_15 */
#define EZHV_PIO16_PIO3_0 IOPCTL_MUX(0, 96, 4) /* PIO3_0 */
#define GPIO3_GPIO0_PIO3_0 IOPCTL_MUX(0, 96, 0) /* PIO3_0 */
#define LPSPI14_SOUT_PIO3_0 IOPCTL_MUX(0, 96, 1) /* PIO3_0 */
#define EZHV_PIO17_PIO3_1 IOPCTL_MUX(0, 97, 4) /* PIO3_1 */
#define GPIO3_GPIO1_PIO3_1 IOPCTL_MUX(0, 97, 0) /* PIO3_1 */
#define LPSPI14_SCK_PIO3_1 IOPCTL_MUX(0, 97, 1) /* PIO3_1 */
#define EZHV_PIO18_PIO3_2 IOPCTL_MUX(0, 98, 4) /* PIO3_2 */
#define GPIO3_GPIO2_PIO3_2 IOPCTL_MUX(0, 98, 0) /* PIO3_2 */
#define LPSPI14_SIN_PIO3_2 IOPCTL_MUX(0, 98, 1) /* PIO3_2 */
#define EZHV_PIO19_PIO3_3 IOPCTL_MUX(0, 99, 4) /* PIO3_3 */
#define GPIO3_GPIO3_PIO3_3 IOPCTL_MUX(0, 99, 0) /* PIO3_3 */
#define LPSPI14_PCS0_PIO3_3 IOPCTL_MUX(0, 99, 1) /* PIO3_3 */
#define GPIO4_GPIO0_PIO4_0 IOPCTL_MUX(2, 0, 0) /* PIO4_0 */
#define LP_FLEXCOMM8_P0_PIO4_0 IOPCTL_MUX(2, 0, 2) /* PIO4_0 */
#define XSPI2_PCS_A_0_PIO4_0 IOPCTL_MUX(2, 0, 1) /* PIO4_0 */
#define GPIO4_GPIO1_PIO4_1 IOPCTL_MUX(2, 1, 0) /* PIO4_1 */
#define LCDIF_DATA20_PIO4_1 IOPCTL_MUX(2, 1, 6) /* PIO4_1 */
#define LP_FLEXCOMM8_P1_PIO4_1 IOPCTL_MUX(2, 1, 2) /* PIO4_1 */
#define XSPI2_DATA0_PIO4_1 IOPCTL_MUX(2, 1, 1) /* PIO4_1 */
#define GPIO4_GPIO2_PIO4_2 IOPCTL_MUX(2, 2, 0) /* PIO4_2 */
#define LCDIF_DATA21_PIO4_2 IOPCTL_MUX(2, 2, 6) /* PIO4_2 */
#define LP_FLEXCOMM8_P2_PIO4_2 IOPCTL_MUX(2, 2, 2) /* PIO4_2 */
#define XSPI2_DATA1_PIO4_2 IOPCTL_MUX(2, 2, 1) /* PIO4_2 */
#define GPIO4_GPIO3_PIO4_3 IOPCTL_MUX(2, 3, 0) /* PIO4_3 */
#define LCDIF_DATA22_PIO4_3 IOPCTL_MUX(2, 3, 6) /* PIO4_3 */
#define LP_FLEXCOMM8_P3_PIO4_3 IOPCTL_MUX(2, 3, 2) /* PIO4_3 */
#define XSPI2_DATA2_PIO4_3 IOPCTL_MUX(2, 3, 1) /* PIO4_3 */
#define GPIO4_GPIO4_PIO4_4 IOPCTL_MUX(2, 4, 0) /* PIO4_4 */
#define LCDIF_DATA23_PIO4_4 IOPCTL_MUX(2, 4, 6) /* PIO4_4 */
#define LP_FLEXCOMM8_P4_PIO4_4 IOPCTL_MUX(2, 4, 2) /* PIO4_4 */
#define XSPI2_DATA3_PIO4_4 IOPCTL_MUX(2, 4, 1) /* PIO4_4 */
#define GPIO4_GPIO5_PIO4_5 IOPCTL_MUX(2, 5, 0) /* PIO4_5 */
#define LP_FLEXCOMM8_P5_PIO4_5 IOPCTL_MUX(2, 5, 2) /* PIO4_5 */
#define XSPI2_DQS_A_0_PIO4_5 IOPCTL_MUX(2, 5, 1) /* PIO4_5 */
#define GPIO4_GPIO6_PIO4_6 IOPCTL_MUX(2, 6, 0) /* PIO4_6 */
#define LCDIF_DATA16_PIO4_6 IOPCTL_MUX(2, 6, 6) /* PIO4_6 */
#define LP_FLEXCOMM8_P6_PIO4_6 IOPCTL_MUX(2, 6, 2) /* PIO4_6 */
#define XSPI2_DATA4_PIO4_6 IOPCTL_MUX(2, 6, 1) /* PIO4_6 */
#define GPIO4_GPIO7_PIO4_7 IOPCTL_MUX(2, 7, 0) /* PIO4_7 */
#define LCDIF_DATA17_PIO4_7 IOPCTL_MUX(2, 7, 6) /* PIO4_7 */
#define LP_FLEXCOMM9_P0_PIO4_7 IOPCTL_MUX(2, 7, 2) /* PIO4_7 */
#define XSPI2_DATA5_PIO4_7 IOPCTL_MUX(2, 7, 1) /* PIO4_7 */
#define GPIO4_GPIO8_PIO4_8 IOPCTL_MUX(2, 8, 0) /* PIO4_8 */
#define LCDIF_DATA18_PIO4_8 IOPCTL_MUX(2, 8, 6) /* PIO4_8 */
#define LP_FLEXCOMM9_P1_PIO4_8 IOPCTL_MUX(2, 8, 2) /* PIO4_8 */
#define XSPI2_DATA6_PIO4_8 IOPCTL_MUX(2, 8, 1) /* PIO4_8 */
#define GPIO4_GPIO9_PIO4_9 IOPCTL_MUX(2, 9, 0) /* PIO4_9 */
#define LCDIF_DATA19_PIO4_9 IOPCTL_MUX(2, 9, 6) /* PIO4_9 */
#define LP_FLEXCOMM9_P2_PIO4_9 IOPCTL_MUX(2, 9, 2) /* PIO4_9 */
#define XSPI2_DATA7_PIO4_9 IOPCTL_MUX(2, 9, 1) /* PIO4_9 */
#define GPIO4_GPIO10_PIO4_10 IOPCTL_MUX(2, 10, 0) /* PIO4_10 */
#define LP_FLEXCOMM9_P3_PIO4_10 IOPCTL_MUX(2, 10, 2) /* PIO4_10 */
#define XSPI2_SCK_A_PIO4_10 IOPCTL_MUX(2, 10, 1) /* PIO4_10 */
#define GPIO4_GPIO11_PIO4_11 IOPCTL_MUX(2, 11, 0) /* PIO4_11 */
#define LP_FLEXCOMM9_P4_PIO4_11 IOPCTL_MUX(2, 11, 2) /* PIO4_11 */
#define XSPI2_PCS_A_1_PIO4_11 IOPCTL_MUX(2, 11, 3) /* PIO4_11 */
#define XSPI2_SCK_A_N_PIO4_11 IOPCTL_MUX(2, 11, 1) /* PIO4_11 */
#define GPIO4_GPIO12_PIO4_12 IOPCTL_MUX(2, 12, 0) /* PIO4_12 */
#define LCDIF_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 6) /* PIO4_12 */
#define LCDIF_DBI_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 7) /* PIO4_12 */
#define LP_FLEXCOMM9_P5_PIO4_12 IOPCTL_MUX(2, 12, 2) /* PIO4_12 */
#define XSPI2_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 1) /* PIO4_12 */
#define GPIO4_GPIO13_PIO4_13 IOPCTL_MUX(2, 13, 0) /* PIO4_13 */
#define LCDIF_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 6) /* PIO4_13 */
#define LCDIF_DBI_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 7) /* PIO4_13 */
#define LP_FLEXCOMM9_P6_PIO4_13 IOPCTL_MUX(2, 13, 2) /* PIO4_13 */
#define XSPI2_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 1) /* PIO4_13 */
#define GPIO4_GPIO14_PIO4_14 IOPCTL_MUX(2, 14, 0) /* PIO4_14 */
#define LCDIF_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 6) /* PIO4_14 */
#define LCDIF_DBI_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 7) /* PIO4_14 */
#define LP_FLEXCOMM10_P0_PIO4_14 IOPCTL_MUX(2, 14, 2) /* PIO4_14 */
#define XSPI2_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 1) /* PIO4_14 */
#define GPIO4_GPIO15_PIO4_15 IOPCTL_MUX(2, 15, 0) /* PIO4_15 */
#define LCDIF_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 6) /* PIO4_15 */
#define LCDIF_DBI_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 7) /* PIO4_15 */
#define LP_FLEXCOMM10_P1_PIO4_15 IOPCTL_MUX(2, 15, 2) /* PIO4_15 */
#define XSPI2_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 1) /* PIO4_15 */
#define GPIO4_GPIO16_PIO4_16 IOPCTL_MUX(2, 16, 0) /* PIO4_16 */
#define LP_FLEXCOMM10_P2_PIO4_16 IOPCTL_MUX(2, 16, 2) /* PIO4_16 */
#define XSPI2_DQS_A_1_PIO4_16 IOPCTL_MUX(2, 16, 1) /* PIO4_16 */
#define GPIO4_GPIO17_PIO4_17 IOPCTL_MUX(2, 17, 0) /* PIO4_17 */
#define LCDIF_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 6) /* PIO4_17 */
#define LCDIF_DBI_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 7) /* PIO4_17 */
#define LP_FLEXCOMM10_P3_PIO4_17 IOPCTL_MUX(2, 17, 2) /* PIO4_17 */
#define XSPI2_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 1) /* PIO4_17 */
#define GPIO4_GPIO18_PIO4_18 IOPCTL_MUX(2, 18, 0) /* PIO4_18 */
#define LCDIF_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 6) /* PIO4_18 */
#define LCDIF_DBI_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 7) /* PIO4_18 */
#define LP_FLEXCOMM10_P4_PIO4_18 IOPCTL_MUX(2, 18, 2) /* PIO4_18 */
#define XSPI2_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 1) /* PIO4_18 */
#define GPIO4_GPIO19_PIO4_19 IOPCTL_MUX(2, 19, 0) /* PIO4_19 */
#define LCDIF_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 6) /* PIO4_19 */
#define LCDIF_DBI_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 7) /* PIO4_19 */
#define LP_FLEXCOMM10_P5_PIO4_19 IOPCTL_MUX(2, 19, 2) /* PIO4_19 */
#define XSPI2_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 1) /* PIO4_19 */
#define GPIO4_GPIO20_PIO4_20 IOPCTL_MUX(2, 20, 0) /* PIO4_20 */
#define LCDIF_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 6) /* PIO4_20 */
#define LCDIF_DBI_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 7) /* PIO4_20 */
#define LP_FLEXCOMM10_P6_PIO4_20 IOPCTL_MUX(2, 20, 2) /* PIO4_20 */
#define XSPI2_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 1) /* PIO4_20 */
#define GPIO5_GPIO0_PIO5_0 IOPCTL_MUX(2, 32, 0) /* PIO5_0 */
#define LP_FLEXCOMM13_P4_PIO5_0 IOPCTL_MUX(2, 32, 2) /* PIO5_0 */
#define XSPI1_PCS_A_0_PIO5_0 IOPCTL_MUX(2, 32, 1) /* PIO5_0 */
#define GPIO5_GPIO1_PIO5_1 IOPCTL_MUX(2, 33, 0) /* PIO5_1 */
#define LP_FLEXCOMM13_P5_PIO5_1 IOPCTL_MUX(2, 33, 2) /* PIO5_1 */
#define XSPI1_DATA0_PIO5_1 IOPCTL_MUX(2, 33, 1) /* PIO5_1 */
#define GPIO5_GPIO2_PIO5_2 IOPCTL_MUX(2, 34, 0) /* PIO5_2 */
#define LP_FLEXCOMM13_P6_PIO5_2 IOPCTL_MUX(2, 34, 2) /* PIO5_2 */
#define XSPI1_DATA1_PIO5_2 IOPCTL_MUX(2, 34, 1) /* PIO5_2 */
#define GPIO5_GPIO3_PIO5_3 IOPCTL_MUX(2, 35, 0) /* PIO5_3 */
#define LP_FLEXCOMM13_P0_PIO5_3 IOPCTL_MUX(2, 35, 2) /* PIO5_3 */
#define XSPI1_DATA2_PIO5_3 IOPCTL_MUX(2, 35, 1) /* PIO5_3 */
#define GPIO5_GPIO4_PIO5_4 IOPCTL_MUX(2, 36, 0) /* PIO5_4 */
#define LP_FLEXCOMM13_P1_PIO5_4 IOPCTL_MUX(2, 36, 2) /* PIO5_4 */
#define XSPI1_DATA3_PIO5_4 IOPCTL_MUX(2, 36, 1) /* PIO5_4 */
#define GPIO5_GPIO5_PIO5_5 IOPCTL_MUX(2, 37, 0) /* PIO5_5 */
#define LP_FLEXCOMM13_P2_PIO5_5 IOPCTL_MUX(2, 37, 2) /* PIO5_5 */
#define XSPI1_DQS_A_0_PIO5_5 IOPCTL_MUX(2, 37, 1) /* PIO5_5 */
#define GPIO5_GPIO6_PIO5_6 IOPCTL_MUX(2, 38, 0) /* PIO5_6 */
#define LP_FLEXCOMM12_P3_PIO5_6 IOPCTL_MUX(2, 38, 2) /* PIO5_6 */
#define XSPI1_DATA4_PIO5_6 IOPCTL_MUX(2, 38, 1) /* PIO5_6 */
#define GPIO5_GPIO7_PIO5_7 IOPCTL_MUX(2, 39, 0) /* PIO5_7 */
#define LP_FLEXCOMM12_P0_PIO5_7 IOPCTL_MUX(2, 39, 2) /* PIO5_7 */
#define XSPI1_DATA5_PIO5_7 IOPCTL_MUX(2, 39, 1) /* PIO5_7 */
#define GPIO5_GPIO8_PIO5_8 IOPCTL_MUX(2, 40, 0) /* PIO5_8 */
#define LP_FLEXCOMM12_P1_PIO5_8 IOPCTL_MUX(2, 40, 2) /* PIO5_8 */
#define XSPI1_DATA6_PIO5_8 IOPCTL_MUX(2, 40, 1) /* PIO5_8 */
#define GPIO5_GPIO9_PIO5_9 IOPCTL_MUX(2, 41, 0) /* PIO5_9 */
#define LP_FLEXCOMM12_P2_PIO5_9 IOPCTL_MUX(2, 41, 2) /* PIO5_9 */
#define XSPI1_DATA7_PIO5_9 IOPCTL_MUX(2, 41, 1) /* PIO5_9 */
#define GPIO5_GPIO10_PIO5_10 IOPCTL_MUX(2, 42, 0) /* PIO5_10 */
#define LP_FLEXCOMM13_P3_PIO5_10 IOPCTL_MUX(2, 42, 2) /* PIO5_10 */
#define XSPI1_SCK_A_PIO5_10 IOPCTL_MUX(2, 42, 1) /* PIO5_10 */
#define GPIO5_GPIO11_PIO5_11 IOPCTL_MUX(2, 43, 0) /* PIO5_11 */
#define LP_FLEXCOMM12_P4_PIO5_11 IOPCTL_MUX(2, 43, 2) /* PIO5_11 */
#define XSPI1_PCS_A_1_PIO5_11 IOPCTL_MUX(2, 43, 3) /* PIO5_11 */
#define XSPI1_SCK_A_N_PIO5_11 IOPCTL_MUX(2, 43, 1) /* PIO5_11 */
#define GPIO5_GPIO12_PIO5_12 IOPCTL_MUX(2, 44, 0) /* PIO5_12 */
#define LP_FLEXCOMM12_P5_PIO5_12 IOPCTL_MUX(2, 44, 2) /* PIO5_12 */
#define XSPI1_DATA8_PIO5_12 IOPCTL_MUX(2, 44, 1) /* PIO5_12 */
#define GPIO5_GPIO13_PIO5_13 IOPCTL_MUX(2, 45, 0) /* PIO5_13 */
#define LP_FLEXCOMM12_P6_PIO5_13 IOPCTL_MUX(2, 45, 2) /* PIO5_13 */
#define XSPI1_DATA9_PIO5_13 IOPCTL_MUX(2, 45, 1) /* PIO5_13 */
#define GPIO5_GPIO14_PIO5_14 IOPCTL_MUX(2, 46, 0) /* PIO5_14 */
#define LP_FLEXCOMM11_P0_PIO5_14 IOPCTL_MUX(2, 46, 2) /* PIO5_14 */
#define XSPI1_DATA10_PIO5_14 IOPCTL_MUX(2, 46, 1) /* PIO5_14 */
#define GPIO5_GPIO15_PIO5_15 IOPCTL_MUX(2, 47, 0) /* PIO5_15 */
#define LP_FLEXCOMM11_P1_PIO5_15 IOPCTL_MUX(2, 47, 2) /* PIO5_15 */
#define XSPI1_DATA11_PIO5_15 IOPCTL_MUX(2, 47, 1) /* PIO5_15 */
#define GPIO5_GPIO16_PIO5_16 IOPCTL_MUX(2, 48, 0) /* PIO5_16 */
#define LP_FLEXCOMM11_P2_PIO5_16 IOPCTL_MUX(2, 48, 2) /* PIO5_16 */
#define XSPI1_DQS_A_1_PIO5_16 IOPCTL_MUX(2, 48, 1) /* PIO5_16 */
#define GPIO5_GPIO17_PIO5_17 IOPCTL_MUX(2, 49, 0) /* PIO5_17 */
#define LP_FLEXCOMM11_P3_PIO5_17 IOPCTL_MUX(2, 49, 2) /* PIO5_17 */
#define XSPI1_DATA12_PIO5_17 IOPCTL_MUX(2, 49, 1) /* PIO5_17 */
#define GPIO5_GPIO18_PIO5_18 IOPCTL_MUX(2, 50, 0) /* PIO5_18 */
#define LP_FLEXCOMM11_P4_PIO5_18 IOPCTL_MUX(2, 50, 2) /* PIO5_18 */
#define XSPI1_DATA13_PIO5_18 IOPCTL_MUX(2, 50, 1) /* PIO5_18 */
#define GPIO5_GPIO19_PIO5_19 IOPCTL_MUX(2, 51, 0) /* PIO5_19 */
#define LP_FLEXCOMM11_P5_PIO5_19 IOPCTL_MUX(2, 51, 2) /* PIO5_19 */
#define XSPI1_DATA14_PIO5_19 IOPCTL_MUX(2, 51, 1) /* PIO5_19 */
#define GPIO5_GPIO20_PIO5_20 IOPCTL_MUX(2, 52, 0) /* PIO5_20 */
#define LP_FLEXCOMM11_P6_PIO5_20 IOPCTL_MUX(2, 52, 2) /* PIO5_20 */
#define XSPI1_DATA15_PIO5_20 IOPCTL_MUX(2, 52, 1) /* PIO5_20 */
#define GPIO7_GPIO0_PIO7_0 IOPCTL_MUX(2, 96, 0) /* PIO7_0 */
#define LP_FLEXCOMM3_P4_PIO7_0 IOPCTL_MUX(2, 96, 2) /* PIO7_0 */
#define LP_FLEXCOMM7_P6_PIO7_0 IOPCTL_MUX(2, 96, 3) /* PIO7_0 */
#define SDHC0_CLK_PIO7_0 IOPCTL_MUX(2, 96, 1) /* PIO7_0 */
#define GPIO7_GPIO1_PIO7_1 IOPCTL_MUX(2, 97, 0) /* PIO7_1 */
#define LP_FLEXCOMM3_P5_PIO7_1 IOPCTL_MUX(2, 97, 2) /* PIO7_1 */
#define LP_FLEXCOMM7_P5_PIO7_1 IOPCTL_MUX(2, 97, 3) /* PIO7_1 */
#define SDHC0_CMD_PIO7_1 IOPCTL_MUX(2, 97, 1) /* PIO7_1 */
#define GPIO7_GPIO2_PIO7_2 IOPCTL_MUX(2, 98, 0) /* PIO7_2 */
#define LP_FLEXCOMM12_P0_PIO7_2 IOPCTL_MUX(2, 98, 2) /* PIO7_2 */
#define USDHC0_USDHC_DATA4_PIO7_2 IOPCTL_MUX(2, 98, 1) /* PIO7_2 */
#define GPIO7_GPIO3_PIO7_3 IOPCTL_MUX(2, 99, 0) /* PIO7_3 */
#define LP_FLEXCOMM12_P1_PIO7_3 IOPCTL_MUX(2, 99, 2) /* PIO7_3 */
#define USDHC0_USDHC_DATA5_PIO7_3 IOPCTL_MUX(2, 99, 1) /* PIO7_3 */
#define GPIO7_GPIO4_PIO7_4 IOPCTL_MUX(2, 100, 0) /* PIO7_4 */
#define LP_FLEXCOMM12_P2_PIO7_4 IOPCTL_MUX(2, 100, 2) /* PIO7_4 */
#define USDHC0_USDHC_DATA6_PIO7_4 IOPCTL_MUX(2, 100, 1) /* PIO7_4 */
#define GPIO7_GPIO5_PIO7_5 IOPCTL_MUX(2, 101, 0) /* PIO7_5 */
#define LP_FLEXCOMM12_P3_PIO7_5 IOPCTL_MUX(2, 101, 2) /* PIO7_5 */
#define USDHC0_USDHC_DATA7_PIO7_5 IOPCTL_MUX(2, 101, 1) /* PIO7_5 */
#define GPIO7_GPIO6_PIO7_6 IOPCTL_MUX(2, 102, 0) /* PIO7_6 */
#define LP_FLEXCOMM12_P4_PIO7_6 IOPCTL_MUX(2, 102, 2) /* PIO7_6 */
#define USDHC0_USDHC_DATA0_PIO7_6 IOPCTL_MUX(2, 102, 1) /* PIO7_6 */
#define GPIO7_GPIO7_PIO7_7 IOPCTL_MUX(2, 103, 0) /* PIO7_7 */
#define LP_FLEXCOMM12_P5_PIO7_7 IOPCTL_MUX(2, 103, 2) /* PIO7_7 */
#define USDHC0_USDHC_DATA1_PIO7_7 IOPCTL_MUX(2, 103, 1) /* PIO7_7 */
#define GPIO7_GPIO8_PIO7_8 IOPCTL_MUX(2, 104, 0) /* PIO7_8 */
#define LP_FLEXCOMM12_P6_PIO7_8 IOPCTL_MUX(2, 104, 2) /* PIO7_8 */
#define LP_FLEXCOMM7_P3_PIO7_8 IOPCTL_MUX(2, 104, 3) /* PIO7_8 */
#define USDHC0_USDHC_DATA2_PIO7_8 IOPCTL_MUX(2, 104, 1) /* PIO7_8 */
#define GPIO7_GPIO9_PIO7_9 IOPCTL_MUX(2, 105, 0) /* PIO7_9 */
#define LP_FLEXCOMM3_P6_PIO7_9 IOPCTL_MUX(2, 105, 2) /* PIO7_9 */
#define LP_FLEXCOMM7_P4_PIO7_9 IOPCTL_MUX(2, 105, 3) /* PIO7_9 */
#define USDHC0_USDHC_DATA3_PIO7_9 IOPCTL_MUX(2, 105, 1) /* PIO7_9 */
#define GPIO7_GPIO10_PIO7_10 IOPCTL_MUX(2, 106, 0) /* PIO7_10 */
#define LP_FLEXCOMM1_P0_PIO7_10 IOPCTL_MUX(2, 106, 2) /* PIO7_10 */
#define SDHC0_DS_PIO7_10 IOPCTL_MUX(2, 106, 5) /* PIO7_10 */
#define SDHC0_WR_PRT_PIO7_10 IOPCTL_MUX(2, 106, 1) /* PIO7_10 */
#define GPIO7_GPIO11_PIO7_11 IOPCTL_MUX(2, 107, 0) /* PIO7_11 */
#define LP_FLEXCOMM1_P1_PIO7_11 IOPCTL_MUX(2, 107, 2) /* PIO7_11 */
#define SDHC0_CARD_DET_N_PIO7_11 IOPCTL_MUX(2, 107, 1) /* PIO7_11 */
#define GPIO7_GPIO12_PIO7_12 IOPCTL_MUX(2, 108, 0) /* PIO7_12 */
#define LP_FLEXCOMM1_P2_PIO7_12 IOPCTL_MUX(2, 108, 2) /* PIO7_12 */
#define SDHC0_RESET_N_PIO7_12 IOPCTL_MUX(2, 108, 1) /* PIO7_12 */
#define GPIO7_GPIO13_PIO7_13 IOPCTL_MUX(2, 109, 0) /* PIO7_13 */
#define LP_FLEXCOMM1_P3_PIO7_13 IOPCTL_MUX(2, 109, 2) /* PIO7_13 */
#define USDHC1_USDHC_DATA4_PIO7_13 IOPCTL_MUX(2, 109, 1) /* PIO7_13 */
#define GPIO7_GPIO14_PIO7_14 IOPCTL_MUX(2, 110, 0) /* PIO7_14 */
#define LP_FLEXCOMM7_P0_PIO7_14 IOPCTL_MUX(2, 110, 2) /* PIO7_14 */
#define USDHC1_USDHC_DATA5_PIO7_14 IOPCTL_MUX(2, 110, 1) /* PIO7_14 */
#define GPIO7_GPIO15_PIO7_15 IOPCTL_MUX(2, 111, 0) /* PIO7_15 */
#define LP_FLEXCOMM7_P1_PIO7_15 IOPCTL_MUX(2, 111, 2) /* PIO7_15 */
#define USDHC1_USDHC_DATA6_PIO7_15 IOPCTL_MUX(2, 111, 1) /* PIO7_15 */
#define GPIO7_GPIO16_PIO7_16 IOPCTL_MUX(2, 112, 0) /* PIO7_16 */
#define LP_FLEXCOMM7_P2_PIO7_16 IOPCTL_MUX(2, 112, 2) /* PIO7_16 */
#define USDHC1_USDHC_DATA7_PIO7_16 IOPCTL_MUX(2, 112, 1) /* PIO7_16 */
#define GPIO7_GPIO17_PIO7_17 IOPCTL_MUX(2, 113, 0) /* PIO7_17 */
#define LP_FLEXCOMM2_P0_PIO7_17 IOPCTL_MUX(2, 113, 2) /* PIO7_17 */
#define SDHC1_CLK_PIO7_17 IOPCTL_MUX(2, 113, 1) /* PIO7_17 */
#define GPIO7_GPIO18_PIO7_18 IOPCTL_MUX(2, 114, 0) /* PIO7_18 */
#define LP_FLEXCOMM2_P1_PIO7_18 IOPCTL_MUX(2, 114, 2) /* PIO7_18 */
#define SDHC1_CMD_PIO7_18 IOPCTL_MUX(2, 114, 1) /* PIO7_18 */
#define GPIO7_GPIO19_PIO7_19 IOPCTL_MUX(2, 115, 0) /* PIO7_19 */
#define LP_FLEXCOMM1_P4_PIO7_19 IOPCTL_MUX(2, 115, 2) /* PIO7_19 */
#define LP_FLEXCOMM7_P3_PIO7_19 IOPCTL_MUX(2, 115, 3) /* PIO7_19 */
#define USDHC1_USDHC_DATA0_PIO7_19 IOPCTL_MUX(2, 115, 1) /* PIO7_19 */
#define GPIO7_GPIO20_PIO7_20 IOPCTL_MUX(2, 116, 0) /* PIO7_20 */
#define LP_FLEXCOMM1_P5_PIO7_20 IOPCTL_MUX(2, 116, 2) /* PIO7_20 */
#define LP_FLEXCOMM2_P4_PIO7_20 IOPCTL_MUX(2, 116, 3) /* PIO7_20 */
#define USDHC1_USDHC_DATA1_PIO7_20 IOPCTL_MUX(2, 116, 1) /* PIO7_20 */
#define GPIO7_GPIO21_PIO7_21 IOPCTL_MUX(2, 117, 0) /* PIO7_21 */
#define LP_FLEXCOMM1_P6_PIO7_21 IOPCTL_MUX(2, 117, 2) /* PIO7_21 */
#define LP_FLEXCOMM2_P5_PIO7_21 IOPCTL_MUX(2, 117, 3) /* PIO7_21 */
#define USDHC1_USDHC_DATA2_PIO7_21 IOPCTL_MUX(2, 117, 1) /* PIO7_21 */
#define GPIO7_GPIO22_PIO7_22 IOPCTL_MUX(2, 118, 0) /* PIO7_22 */
#define LP_FLEXCOMM2_P2_PIO7_22 IOPCTL_MUX(2, 118, 2) /* PIO7_22 */
#define USDHC1_USDHC_DATA3_PIO7_22 IOPCTL_MUX(2, 118, 1) /* PIO7_22 */
