zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT798SGAWAR-pinctrl.h
#define GPIO7_GPIO23_PIO7_23 IOPCTL_MUX(2, 119, 0) /* PIO7_23 */
#define LP_FLEXCOMM2_P3_PIO7_23 IOPCTL_MUX(2, 119, 2) /* PIO7_23 */
#define SDHC1_DS_PIO7_23 IOPCTL_MUX(2, 119, 5) /* PIO7_23 */
#define SDHC1_WR_PRT_PIO7_23 IOPCTL_MUX(2, 119, 1) /* PIO7_23 */
#define GPIO7_GPIO25_PIO7_25 IOPCTL_MUX(2, 121, 0) /* PIO7_25 */
#define LP_FLEXCOMM13_P5_PIO7_25 IOPCTL_MUX(2, 121, 2) /* PIO7_25 */
#define LP_FLEXCOMM2_P6_PIO7_25 IOPCTL_MUX(2, 121, 3) /* PIO7_25 */
#define SDHC1_RESET_N_PIO7_25 IOPCTL_MUX(2, 121, 1) /* PIO7_25 */
#define CTIMER5_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER_S_INP0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define GPIO8_GPIO0_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define JTAG_TCK_PIO8_0 IOPCTL_MUX(1, 0, 5) /* PIO8_0 */
#define LP_FLEXCOMM17_P5_PIO8_0 IOPCTL_MUX(1, 0, 1) /* PIO8_0 */
#define PINT1_PINT0_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT1_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT2_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT3_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define SWD_CLK_PIO8_0 IOPCTL_MUX(1, 0, 5) /* PIO8_0 */
#define CTIMER5_MATCH0_PIO8_1 IOPCTL_MUX(1, 1, 2) /* PIO8_1 */
#define GPIO8_GPIO1_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define JTAG_TMS_PIO8_1 IOPCTL_MUX(1, 1, 5) /* PIO8_1 */
#define LP_FLEXCOMM17_P6_PIO8_1 IOPCTL_MUX(1, 1, 1) /* PIO8_1 */
#define PINT1_PINT0_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT1_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT2_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT3_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define SWD_DIO_PIO8_1 IOPCTL_MUX(1, 1, 5) /* PIO8_1 */
#define CTIMER5_MATCH1_PIO8_2 IOPCTL_MUX(1, 2, 2) /* PIO8_2 */
#define GPIO8_GPIO2_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define JTAG_TDI_PIO8_2 IOPCTL_MUX(1, 2, 5) /* PIO8_2 */
#define LP_FLEXCOMM17_P2_PIO8_2 IOPCTL_MUX(1, 2, 1) /* PIO8_2 */
#define PINT1_PINT0_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT1_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT2_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT3_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define CTIMER5_CAPTURE0_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER5_CAPTURE1_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER5_CAPTURE2_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER5_CAPTURE3_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER6_CAPTURE0_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER6_CAPTURE1_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER6_CAPTURE2_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER6_CAPTURE3_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER7_CAPTURE0_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER7_CAPTURE1_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER7_CAPTURE2_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER7_CAPTURE3_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER_S_INP1_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define GPIO8_GPIO3_PIO8_3 IOPCTL_MUX(1, 3, 0) /* PIO8_3 */
#define JTAG_TDO_PIO8_3 IOPCTL_MUX(1, 3, 5) /* PIO8_3 */
#define LP_FLEXCOMM17_P3_PIO8_3 IOPCTL_MUX(1, 3, 1) /* PIO8_3 */
#define PINT1_PINT0_PIO8_3 IOPCTL_MUX(1, 3, 0) /* PIO8_3 */
#define PINT1_PINT1_PIO8_3 IOPCTL_MUX(1, 3, 0) /* PIO8_3 */
#define PINT1_PINT2_PIO8_3 IOPCTL_MUX(1, 3, 0) /* PIO8_3 */
#define PINT1_PINT3_PIO8_3 IOPCTL_MUX(1, 3, 0) /* PIO8_3 */
#define SWD_OUT_PIO8_3 IOPCTL_MUX(1, 3, 5) /* PIO8_3 */
#define UTICK1_CAPTURE0_PIO8_3 IOPCTL_MUX(1, 3, 3) /* PIO8_3 */
#define CLKCTL0_MCLK_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define CTIMER5_MATCH2_PIO8_4 IOPCTL_MUX(1, 4, 2) /* PIO8_4 */
#define GPIO8_GPIO4_PIO8_4 IOPCTL_MUX(1, 4, 0) /* PIO8_4 */
#define JTAG_TRSTN_PIO8_4 IOPCTL_MUX(1, 4, 5) /* PIO8_4 */
#define LP_FLEXCOMM17_P4_PIO8_4 IOPCTL_MUX(1, 4, 1) /* PIO8_4 */
#define PINT1_PINT0_PIO8_4 IOPCTL_MUX(1, 4, 0) /* PIO8_4 */
#define PINT1_PINT1_PIO8_4 IOPCTL_MUX(1, 4, 0) /* PIO8_4 */
#define PINT1_PINT2_PIO8_4 IOPCTL_MUX(1, 4, 0) /* PIO8_4 */
#define PINT1_PINT3_PIO8_4 IOPCTL_MUX(1, 4, 0) /* PIO8_4 */
#define SCT0_IN0_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN1_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN2_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN3_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN4_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN5_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define SCT0_IN6_PIO8_4 IOPCTL_MUX(1, 4, 3) /* PIO8_4 */
#define CTIMER5_CAPTURE0_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER5_CAPTURE1_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER5_CAPTURE2_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER5_CAPTURE3_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER5_MATCH3_PIO8_5 IOPCTL_MUX(1, 5, 2) /* PIO8_5 */
#define CTIMER6_CAPTURE0_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER6_CAPTURE1_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER6_CAPTURE2_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER6_CAPTURE3_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER7_CAPTURE0_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER7_CAPTURE1_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER7_CAPTURE2_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER7_CAPTURE3_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define CTIMER_S_INP0_PIO8_5 IOPCTL_MUX(1, 5, 3) /* PIO8_5 */
#define GPIO8_GPIO5_PIO8_5 IOPCTL_MUX(1, 5, 0) /* PIO8_5 */
#define LP_FLEXCOMM17_P0_PIO8_5 IOPCTL_MUX(1, 5, 1) /* PIO8_5 */
#define PINT1_PINT0_PIO8_5 IOPCTL_MUX(1, 5, 0) /* PIO8_5 */
#define PINT1_PINT1_PIO8_5 IOPCTL_MUX(1, 5, 0) /* PIO8_5 */
#define PINT1_PINT2_PIO8_5 IOPCTL_MUX(1, 5, 0) /* PIO8_5 */
#define PINT1_PINT3_PIO8_5 IOPCTL_MUX(1, 5, 0) /* PIO8_5 */
#define CMP0_OUT_PIO8_6 IOPCTL_MUX(1, 6, 4) /* PIO8_6 */
#define CTIMER6_MATCH0_PIO8_6 IOPCTL_MUX(1, 6, 2) /* PIO8_6 */
#define GPIO8_GPIO6_PIO8_6 IOPCTL_MUX(1, 6, 0) /* PIO8_6 */
#define LP_FLEXCOMM17_P1_PIO8_6 IOPCTL_MUX(1, 6, 1) /* PIO8_6 */
#define PINT1_PINT0_PIO8_6 IOPCTL_MUX(1, 6, 0) /* PIO8_6 */
#define PINT1_PINT1_PIO8_6 IOPCTL_MUX(1, 6, 0) /* PIO8_6 */
#define PINT1_PINT2_PIO8_6 IOPCTL_MUX(1, 6, 0) /* PIO8_6 */
#define PINT1_PINT3_PIO8_6 IOPCTL_MUX(1, 6, 0) /* PIO8_6 */
#define CTIMER6_MATCH1_PIO8_7 IOPCTL_MUX(1, 7, 2) /* PIO8_7 */
#define GPIO8_GPIO7_PIO8_7 IOPCTL_MUX(1, 7, 0) /* PIO8_7 */
#define LP_FLEXCOMM18_P0_PIO8_7 IOPCTL_MUX(1, 7, 1) /* PIO8_7 */
#define PINT1_PINT0_PIO8_7 IOPCTL_MUX(1, 7, 0) /* PIO8_7 */
#define PINT1_PINT1_PIO8_7 IOPCTL_MUX(1, 7, 0) /* PIO8_7 */
#define PINT1_PINT2_PIO8_7 IOPCTL_MUX(1, 7, 0) /* PIO8_7 */
#define PINT1_PINT3_PIO8_7 IOPCTL_MUX(1, 7, 0) /* PIO8_7 */
#define CTIMER5_CAPTURE0_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER5_CAPTURE1_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER5_CAPTURE2_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER5_CAPTURE3_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER6_CAPTURE0_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER6_CAPTURE1_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER6_CAPTURE2_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER6_CAPTURE3_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER7_CAPTURE0_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER7_CAPTURE1_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER7_CAPTURE2_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER7_CAPTURE3_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define CTIMER_S_INP2_PIO8_8 IOPCTL_MUX(1, 8, 2) /* PIO8_8 */
#define GPIO8_GPIO8_PIO8_8 IOPCTL_MUX(1, 8, 0) /* PIO8_8 */
#define LP_FLEXCOMM18_P1_PIO8_8 IOPCTL_MUX(1, 8, 1) /* PIO8_8 */
#define PINT1_PINT0_PIO8_8 IOPCTL_MUX(1, 8, 0) /* PIO8_8 */
#define PINT1_PINT1_PIO8_8 IOPCTL_MUX(1, 8, 0) /* PIO8_8 */
#define PINT1_PINT2_PIO8_8 IOPCTL_MUX(1, 8, 0) /* PIO8_8 */
#define PINT1_PINT3_PIO8_8 IOPCTL_MUX(1, 8, 0) /* PIO8_8 */
#define CTIMER6_MATCH2_PIO8_9 IOPCTL_MUX(1, 9, 2) /* PIO8_9 */
#define GPIO8_GPIO9_PIO8_9 IOPCTL_MUX(1, 9, 0) /* PIO8_9 */
#define LP_FLEXCOMM18_P2_PIO8_9 IOPCTL_MUX(1, 9, 1) /* PIO8_9 */
#define PINT1_PINT0_PIO8_9 IOPCTL_MUX(1, 9, 0) /* PIO8_9 */
#define PINT1_PINT1_PIO8_9 IOPCTL_MUX(1, 9, 0) /* PIO8_9 */
#define PINT1_PINT2_PIO8_9 IOPCTL_MUX(1, 9, 0) /* PIO8_9 */
#define PINT1_PINT3_PIO8_9 IOPCTL_MUX(1, 9, 0) /* PIO8_9 */
#define CTIMER5_CAPTURE0_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER5_CAPTURE1_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER5_CAPTURE2_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER5_CAPTURE3_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER6_CAPTURE0_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER6_CAPTURE1_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER6_CAPTURE2_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER6_CAPTURE3_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER7_CAPTURE0_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER7_CAPTURE1_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER7_CAPTURE2_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER7_CAPTURE3_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define CTIMER_S_INP3_PIO8_10 IOPCTL_MUX(1, 10, 2) /* PIO8_10 */
#define GPIO8_GPIO10_PIO8_10 IOPCTL_MUX(1, 10, 0) /* PIO8_10 */
#define LP_FLEXCOMM18_P3_PIO8_10 IOPCTL_MUX(1, 10, 1) /* PIO8_10 */
#define PINT1_PINT0_PIO8_10 IOPCTL_MUX(1, 10, 0) /* PIO8_10 */
#define PINT1_PINT1_PIO8_10 IOPCTL_MUX(1, 10, 0) /* PIO8_10 */
#define PINT1_PINT2_PIO8_10 IOPCTL_MUX(1, 10, 0) /* PIO8_10 */
#define PINT1_PINT3_PIO8_10 IOPCTL_MUX(1, 10, 0) /* PIO8_10 */
#define CTIMER6_MATCH3_PIO8_11 IOPCTL_MUX(1, 11, 2) /* PIO8_11 */
#define GPIO8_GPIO11_PIO8_11 IOPCTL_MUX(1, 11, 0) /* PIO8_11 */
#define LP_FLEXCOMM17_P4_PIO8_11 IOPCTL_MUX(1, 11, 4) /* PIO8_11 */
#define LP_FLEXCOMM18_P4_PIO8_11 IOPCTL_MUX(1, 11, 1) /* PIO8_11 */
#define PINT1_PINT0_PIO8_11 IOPCTL_MUX(1, 11, 0) /* PIO8_11 */
#define PINT1_PINT1_PIO8_11 IOPCTL_MUX(1, 11, 0) /* PIO8_11 */
#define PINT1_PINT2_PIO8_11 IOPCTL_MUX(1, 11, 0) /* PIO8_11 */
#define PINT1_PINT3_PIO8_11 IOPCTL_MUX(1, 11, 0) /* PIO8_11 */
#define UTICK1_CAPTURE1_PIO8_11 IOPCTL_MUX(1, 11, 3) /* PIO8_11 */
#define CTIMER5_CAPTURE0_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER5_CAPTURE1_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER5_CAPTURE2_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER5_CAPTURE3_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER6_CAPTURE0_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER6_CAPTURE1_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER6_CAPTURE2_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER6_CAPTURE3_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER7_CAPTURE0_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER7_CAPTURE1_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER7_CAPTURE2_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER7_CAPTURE3_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define CTIMER7_MATCH0_PIO8_12 IOPCTL_MUX(1, 12, 2) /* PIO8_12 */
#define CTIMER_S_INP1_PIO8_12 IOPCTL_MUX(1, 12, 3) /* PIO8_12 */
#define GPIO8_GPIO12_PIO8_12 IOPCTL_MUX(1, 12, 0) /* PIO8_12 */
#define LP_FLEXCOMM17_P2_PIO8_12 IOPCTL_MUX(1, 12, 4) /* PIO8_12 */
#define LP_FLEXCOMM18_P5_PIO8_12 IOPCTL_MUX(1, 12, 1) /* PIO8_12 */
#define PINT1_PINT0_PIO8_12 IOPCTL_MUX(1, 12, 0) /* PIO8_12 */
#define PINT1_PINT1_PIO8_12 IOPCTL_MUX(1, 12, 0) /* PIO8_12 */
#define PINT1_PINT2_PIO8_12 IOPCTL_MUX(1, 12, 0) /* PIO8_12 */
#define PINT1_PINT3_PIO8_12 IOPCTL_MUX(1, 12, 0) /* PIO8_12 */
#define CTIMER5_CAPTURE0_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER5_CAPTURE1_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER5_CAPTURE2_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER5_CAPTURE3_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER6_CAPTURE0_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER6_CAPTURE1_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER6_CAPTURE2_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER6_CAPTURE3_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER7_CAPTURE0_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER7_CAPTURE1_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER7_CAPTURE2_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER7_CAPTURE3_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define CTIMER7_MATCH1_PIO8_13 IOPCTL_MUX(1, 13, 2) /* PIO8_13 */
#define CTIMER_S_INP3_PIO8_13 IOPCTL_MUX(1, 13, 3) /* PIO8_13 */
#define GPIO8_GPIO13_PIO8_13 IOPCTL_MUX(1, 13, 0) /* PIO8_13 */
#define LP_FLEXCOMM17_P3_PIO8_13 IOPCTL_MUX(1, 13, 4) /* PIO8_13 */
#define LP_FLEXCOMM18_P6_PIO8_13 IOPCTL_MUX(1, 13, 1) /* PIO8_13 */
#define PINT1_PINT0_PIO8_13 IOPCTL_MUX(1, 13, 0) /* PIO8_13 */
#define PINT1_PINT1_PIO8_13 IOPCTL_MUX(1, 13, 0) /* PIO8_13 */
#define PINT1_PINT2_PIO8_13 IOPCTL_MUX(1, 13, 0) /* PIO8_13 */
#define PINT1_PINT3_PIO8_13 IOPCTL_MUX(1, 13, 0) /* PIO8_13 */
#define CTIMER7_MATCH2_PIO8_14 IOPCTL_MUX(1, 14, 2) /* PIO8_14 */
#define GPIO8_GPIO14_PIO8_14 IOPCTL_MUX(1, 14, 0) /* PIO8_14 */
#define I3C2_SDA_PIO8_14 IOPCTL_MUX(1, 14, 4) /* PIO8_14 */
#define LP_FLEXCOMM19_P0_PIO8_14 IOPCTL_MUX(1, 14, 1) /* PIO8_14 */
#define PINT1_PINT0_PIO8_14 IOPCTL_MUX(1, 14, 0) /* PIO8_14 */
#define PINT1_PINT1_PIO8_14 IOPCTL_MUX(1, 14, 0) /* PIO8_14 */
#define PINT1_PINT2_PIO8_14 IOPCTL_MUX(1, 14, 0) /* PIO8_14 */
#define PINT1_PINT3_PIO8_14 IOPCTL_MUX(1, 14, 0) /* PIO8_14 */
#define SAI3_TX_SYNC_PIO8_14 IOPCTL_MUX(1, 14, 3) /* PIO8_14 */
#define CTIMER7_MATCH3_PIO8_15 IOPCTL_MUX(1, 15, 2) /* PIO8_15 */
#define GPIO8_GPIO15_PIO8_15 IOPCTL_MUX(1, 15, 0) /* PIO8_15 */
#define I3C2_SCL_PIO8_15 IOPCTL_MUX(1, 15, 4) /* PIO8_15 */
#define LP_FLEXCOMM19_P1_PIO8_15 IOPCTL_MUX(1, 15, 1) /* PIO8_15 */
#define PINT1_PINT0_PIO8_15 IOPCTL_MUX(1, 15, 0) /* PIO8_15 */
#define PINT1_PINT1_PIO8_15 IOPCTL_MUX(1, 15, 0) /* PIO8_15 */
#define PINT1_PINT2_PIO8_15 IOPCTL_MUX(1, 15, 0) /* PIO8_15 */
#define PINT1_PINT3_PIO8_15 IOPCTL_MUX(1, 15, 0) /* PIO8_15 */
#define SAI3_TX_BCLK_PIO8_15 IOPCTL_MUX(1, 15, 3) /* PIO8_15 */
#define CTIMER5_CAPTURE0_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER5_CAPTURE1_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER5_CAPTURE2_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER5_CAPTURE3_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER6_CAPTURE0_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER6_CAPTURE1_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER6_CAPTURE2_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER6_CAPTURE3_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER7_CAPTURE0_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER7_CAPTURE1_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER7_CAPTURE2_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER7_CAPTURE3_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define CTIMER_S_INP4_PIO8_16 IOPCTL_MUX(1, 16, 2) /* PIO8_16 */
#define GPIO8_GPIO16_PIO8_16 IOPCTL_MUX(1, 16, 0) /* PIO8_16 */
#define I3C2_PUR_PIO8_16 IOPCTL_MUX(1, 16, 4) /* PIO8_16 */
#define LP_FLEXCOMM19_P2_PIO8_16 IOPCTL_MUX(1, 16, 1) /* PIO8_16 */
#define PINT1_PINT0_PIO8_16 IOPCTL_MUX(1, 16, 0) /* PIO8_16 */
#define PINT1_PINT1_PIO8_16 IOPCTL_MUX(1, 16, 0) /* PIO8_16 */
#define PINT1_PINT2_PIO8_16 IOPCTL_MUX(1, 16, 0) /* PIO8_16 */
#define PINT1_PINT3_PIO8_16 IOPCTL_MUX(1, 16, 0) /* PIO8_16 */
#define SAI3_TX_DATA0_PIO8_16 IOPCTL_MUX(1, 16, 3) /* PIO8_16 */
#define CTIMER5_CAPTURE0_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER5_CAPTURE1_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER5_CAPTURE2_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER5_CAPTURE3_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER6_CAPTURE0_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER6_CAPTURE1_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER6_CAPTURE2_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER6_CAPTURE3_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER7_CAPTURE0_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER7_CAPTURE1_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER7_CAPTURE2_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER7_CAPTURE3_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define CTIMER_S_INP5_PIO8_17 IOPCTL_MUX(1, 17, 2) /* PIO8_17 */
#define GPIO8_GPIO17_PIO8_17 IOPCTL_MUX(1, 17, 0) /* PIO8_17 */
#define LP_FLEXCOMM19_P3_PIO8_17 IOPCTL_MUX(1, 17, 1) /* PIO8_17 */
#define PINT1_PINT0_PIO8_17 IOPCTL_MUX(1, 17, 0) /* PIO8_17 */
#define PINT1_PINT1_PIO8_17 IOPCTL_MUX(1, 17, 0) /* PIO8_17 */
#define PINT1_PINT2_PIO8_17 IOPCTL_MUX(1, 17, 0) /* PIO8_17 */
#define PINT1_PINT3_PIO8_17 IOPCTL_MUX(1, 17, 0) /* PIO8_17 */
#define SAI3_RX_SYNC_PIO8_17 IOPCTL_MUX(1, 17, 3) /* PIO8_17 */
#define CTIMER5_CAPTURE0_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER5_CAPTURE1_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER5_CAPTURE2_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER5_CAPTURE3_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER5_MATCH0_PIO8_18 IOPCTL_MUX(1, 18, 2) /* PIO8_18 */
#define CTIMER6_CAPTURE0_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER6_CAPTURE1_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER6_CAPTURE2_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER6_CAPTURE3_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER7_CAPTURE0_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER7_CAPTURE1_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER7_CAPTURE2_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER7_CAPTURE3_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define CTIMER_S_INP4_PIO8_18 IOPCTL_MUX(1, 18, 3) /* PIO8_18 */
#define GPIO8_GPIO18_PIO8_18 IOPCTL_MUX(1, 18, 0) /* PIO8_18 */
#define LP_FLEXCOMM19_P4_PIO8_18 IOPCTL_MUX(1, 18, 1) /* PIO8_18 */
#define PINT1_PINT0_PIO8_18 IOPCTL_MUX(1, 18, 0) /* PIO8_18 */
#define PINT1_PINT1_PIO8_18 IOPCTL_MUX(1, 18, 0) /* PIO8_18 */
#define PINT1_PINT2_PIO8_18 IOPCTL_MUX(1, 18, 0) /* PIO8_18 */
#define PINT1_PINT3_PIO8_18 IOPCTL_MUX(1, 18, 0) /* PIO8_18 */
#define CMP0_OUT_PIO8_19 IOPCTL_MUX(1, 19, 4) /* PIO8_19 */
#define CTIMER5_CAPTURE0_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER5_CAPTURE1_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER5_CAPTURE2_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER5_CAPTURE3_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER5_MATCH1_PIO8_19 IOPCTL_MUX(1, 19, 2) /* PIO8_19 */
#define CTIMER6_CAPTURE0_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER6_CAPTURE1_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER6_CAPTURE2_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER6_CAPTURE3_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER7_CAPTURE0_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER7_CAPTURE1_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER7_CAPTURE2_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER7_CAPTURE3_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define CTIMER_S_INP6_PIO8_19 IOPCTL_MUX(1, 19, 3) /* PIO8_19 */
#define GPIO8_GPIO19_PIO8_19 IOPCTL_MUX(1, 19, 0) /* PIO8_19 */
#define LP_FLEXCOMM19_P5_PIO8_19 IOPCTL_MUX(1, 19, 1) /* PIO8_19 */
#define PINT1_PINT0_PIO8_19 IOPCTL_MUX(1, 19, 0) /* PIO8_19 */
#define PINT1_PINT1_PIO8_19 IOPCTL_MUX(1, 19, 0) /* PIO8_19 */
#define PINT1_PINT2_PIO8_19 IOPCTL_MUX(1, 19, 0) /* PIO8_19 */
#define PINT1_PINT3_PIO8_19 IOPCTL_MUX(1, 19, 0) /* PIO8_19 */
#define CTIMER5_CAPTURE0_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER5_CAPTURE1_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER5_CAPTURE2_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER5_CAPTURE3_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER6_CAPTURE0_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER6_CAPTURE1_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER6_CAPTURE2_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER6_CAPTURE3_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER7_CAPTURE0_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER7_CAPTURE1_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER7_CAPTURE2_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER7_CAPTURE3_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define CTIMER_S_INP7_PIO8_20 IOPCTL_MUX(1, 20, 2) /* PIO8_20 */
#define GPIO8_GPIO20_PIO8_20 IOPCTL_MUX(1, 20, 0) /* PIO8_20 */
#define I3C3_PUR_PIO8_20 IOPCTL_MUX(1, 20, 4) /* PIO8_20 */
#define LP_FLEXCOMM19_P6_PIO8_20 IOPCTL_MUX(1, 20, 1) /* PIO8_20 */
#define PINT1_PINT0_PIO8_20 IOPCTL_MUX(1, 20, 0) /* PIO8_20 */
#define PINT1_PINT1_PIO8_20 IOPCTL_MUX(1, 20, 0) /* PIO8_20 */
#define PINT1_PINT2_PIO8_20 IOPCTL_MUX(1, 20, 0) /* PIO8_20 */
#define PINT1_PINT3_PIO8_20 IOPCTL_MUX(1, 20, 0) /* PIO8_20 */
#define UTICK1_CAPTURE2_PIO8_20 IOPCTL_MUX(1, 20, 3) /* PIO8_20 */
#define CTIMER5_MATCH0_PIO8_21 IOPCTL_MUX(1, 21, 2) /* PIO8_21 */
#define GPIO8_GPIO21_PIO8_21 IOPCTL_MUX(1, 21, 0) /* PIO8_21 */
#define I3C3_SDA_PIO8_21 IOPCTL_MUX(1, 21, 4) /* PIO8_21 */
#define LP_FLEXCOMM20_P3_PIO8_21 IOPCTL_MUX(1, 21, 1) /* PIO8_21 */
#define LP_FLEXCOMM3_P0_PIO8_21 IOPCTL_MUX(1, 21, 3) /* PIO8_21 */
#define PINT1_PINT0_PIO8_21 IOPCTL_MUX(1, 21, 0) /* PIO8_21 */
#define PINT1_PINT1_PIO8_21 IOPCTL_MUX(1, 21, 0) /* PIO8_21 */
#define PINT1_PINT2_PIO8_21 IOPCTL_MUX(1, 21, 0) /* PIO8_21 */
#define PINT1_PINT3_PIO8_21 IOPCTL_MUX(1, 21, 0) /* PIO8_21 */
#define CTIMER5_MATCH1_PIO8_22 IOPCTL_MUX(1, 22, 2) /* PIO8_22 */
#define GPIO8_GPIO22_PIO8_22 IOPCTL_MUX(1, 22, 0) /* PIO8_22 */
#define I3C3_SCL_PIO8_22 IOPCTL_MUX(1, 22, 4) /* PIO8_22 */
#define LP_FLEXCOMM20_P4_PIO8_22 IOPCTL_MUX(1, 22, 1) /* PIO8_22 */
#define LP_FLEXCOMM3_P1_PIO8_22 IOPCTL_MUX(1, 22, 3) /* PIO8_22 */
#define PINT1_PINT0_PIO8_22 IOPCTL_MUX(1, 22, 0) /* PIO8_22 */
#define PINT1_PINT1_PIO8_22 IOPCTL_MUX(1, 22, 0) /* PIO8_22 */
#define PINT1_PINT2_PIO8_22 IOPCTL_MUX(1, 22, 0) /* PIO8_22 */
#define PINT1_PINT3_PIO8_22 IOPCTL_MUX(1, 22, 0) /* PIO8_22 */
#define CTIMER5_MATCH2_PIO8_23 IOPCTL_MUX(1, 23, 2) /* PIO8_23 */
#define GPIO8_GPIO23_PIO8_23 IOPCTL_MUX(1, 23, 0) /* PIO8_23 */
#define LP_FLEXCOMM19_P0_PIO8_23 IOPCTL_MUX(1, 23, 3) /* PIO8_23 */
#define PINT1_PINT0_PIO8_23 IOPCTL_MUX(1, 23, 0) /* PIO8_23 */
#define PINT1_PINT1_PIO8_23 IOPCTL_MUX(1, 23, 0) /* PIO8_23 */
#define PINT1_PINT2_PIO8_23 IOPCTL_MUX(1, 23, 0) /* PIO8_23 */
#define PINT1_PINT3_PIO8_23 IOPCTL_MUX(1, 23, 0) /* PIO8_23 */
#define SAI3_RX_BCLK_PIO8_23 IOPCTL_MUX(1, 23, 1) /* PIO8_23 */
#define CTIMER5_MATCH3_PIO8_24 IOPCTL_MUX(1, 24, 2) /* PIO8_24 */
#define GPIO8_GPIO24_PIO8_24 IOPCTL_MUX(1, 24, 0) /* PIO8_24 */
#define LP_FLEXCOMM19_P1_PIO8_24 IOPCTL_MUX(1, 24, 3) /* PIO8_24 */
#define PINT1_PINT0_PIO8_24 IOPCTL_MUX(1, 24, 0) /* PIO8_24 */
#define PINT1_PINT1_PIO8_24 IOPCTL_MUX(1, 24, 0) /* PIO8_24 */
#define PINT1_PINT2_PIO8_24 IOPCTL_MUX(1, 24, 0) /* PIO8_24 */
#define PINT1_PINT3_PIO8_24 IOPCTL_MUX(1, 24, 0) /* PIO8_24 */
#define SAI3_RX_DATA0_PIO8_24 IOPCTL_MUX(1, 24, 1) /* PIO8_24 */
#define CTIMER6_MATCH0_PIO8_25 IOPCTL_MUX(1, 25, 2) /* PIO8_25 */
#define GPIO8_GPIO25_PIO8_25 IOPCTL_MUX(1, 25, 0) /* PIO8_25 */
